In [1]:
import pandas as pd

### Read the data

In [2]:
# read the url
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

titanic_data = pd.read_csv(url)

In [8]:
titanic_data.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### Select one column

In [9]:
titanic_data['Age']

0       29.00
1        2.00
2       30.00
3       25.00
4        0.92
        ...
1308    27.00
1309    26.00
1310    22.00
1311    24.00
1312    29.00
Name: Age, Length: 1313, dtype: float64

### Select multiple columns

In [ ]:
['Age', 'Sex', 'Survived']

In [12]:
titanic_data[['Age', 'Sex', 'Survived']].head()

     Age     Sex  Survived
0  29.00  female         1
1   2.00  female         0
2  30.00    male         0
3  25.00  female         0
4   0.92    male         1

### Selecting rows

In [13]:
titanic_data.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [21]:
titanic_data.loc[0:2]

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

### Use the 'loc' function to select rows and columns

titanic_data.loc[rows, columns]

In [25]:
titanic_data.loc[0:2, ['Name', 'Age', 'Sex']]

                                  Name   Age     Sex
0         Allen, Miss Elisabeth Walton  29.0  female
1          Allison, Miss Helen Loraine   2.0  female
2  Allison, Mr Hudson Joshua Creighton  30.0    male

### Use the 'iloc' function to select rows and columns

titanic_data.iloc[rows, columns]

In [29]:
titanic_data.iloc[0:2, 2:4]

    Age     Sex
0  29.0  female
1   2.0  female